robovero/firmware/src/wrap/_LPC17xx.c
/*******************************************************************************
 * @file
 * @purpose		
 * @version		0.1
 *------------------------------------------------------------------------------
 * Copyright (C) 2011 Gumstix Inc.
 * All rights reserved.
 *
 * Contributer(s):
 *   Neil MacMunn   <neil@gumstix.com>
 *------------------------------------------------------------------------------
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 * 
 * Redistributions of source code must retain the above copyright notice, this
 * 	list of conditions and the following disclaimer.
 * 
 * Redistributions in binary form must reproduce the above copyright notice,
 *  this list of conditions and the following disclaimer in the documentation
 *  and/or other materials provided with the distribution.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 ******************************************************************************/

#include "LPC17xx.h"

#include "return.h"

int _LPC_UART0_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_UART0_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART0_TypeDef_RBR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->RBR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART0_TypeDef_THR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_UART0_TypeDef_ptr->THR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_DLL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->DLL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->DLL = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_DLM(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->DLM);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->DLM = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_IER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->IER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->IER = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_IIR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->IIR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART0_TypeDef_FCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_UART0_TypeDef_ptr->FCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_LCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->LCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->LCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_LSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->LSR);
	writeUSBOutString(str);
	return 0;
}

