robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_UART0_TypeDef_SCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->SCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->SCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_ACR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->ACR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->ACR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_ICR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->ICR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->ICR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_FDR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->FDR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->FDR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_TER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->TER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART0_TypeDef_ptr->TER = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART0_TypeDef_FIFOLVL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART0_TypeDef* LPC_UART0_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART0_TypeDef_ptr = (LPC_UART0_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART0_TypeDef_ptr->FIFOLVL);
	writeUSBOutString(str);
	return 0;
}

int _LPC_CANCR_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_CANCR_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_CANCR_TypeDef_CANTxSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANCR_TypeDef* LPC_CANCR_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANCR_TypeDef_ptr = (LPC_CANCR_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANCR_TypeDef_ptr->CANTxSR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_CANCR_TypeDef_CANRxSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANCR_TypeDef* LPC_CANCR_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANCR_TypeDef_ptr = (LPC_CANCR_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANCR_TypeDef_ptr->CANRxSR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_CANCR_TypeDef_CANMSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANCR_TypeDef* LPC_CANCR_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANCR_TypeDef_ptr = (LPC_CANCR_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANCR_TypeDef_ptr->CANMSR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPIO_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_GPIO_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPIO_TypeDef_FIODIR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->FIODIR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr->FIODIR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

/*int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}*/

int _LPC_GPIO_TypeDef_FIOMASK(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->FIOMASK);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr->FIOMASK = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

/*int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

