robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}*/

int _LPC_GPIO_TypeDef_FIOPIN(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->FIOPIN);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr->FIOPIN = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

/*int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}*/

int _LPC_GPIO_TypeDef_FIOSET(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->FIOSET);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr->FIOSET = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

/*int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}*/

int _LPC_GPIO_TypeDef_FIOCLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_GPIO_TypeDef_ptr->FIOCLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

/*int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIO_TypeDef_(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIO_TypeDef* LPC_GPIO_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIO_TypeDef_ptr = (LPC_GPIO_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIO_TypeDef_ptr->);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIO_TypeDef_ptr-> = (struct) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}*/

int _LPC_PINCON_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_PINCON_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL1);
		writeUSBOutString(str);
		return 0;
	}

