robovero/firmware/src/wrap/_LPC17xx.c
	LPC_PINCON_TypeDef_ptr->PINSEL1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL4(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL4);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL4 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL5(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL5);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL5 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL6(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL6);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL6 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL7(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL7);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL7 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL8(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL8);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL8 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL9(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL9);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL9 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINSEL10(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINSEL10);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINSEL10 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE1);
		writeUSBOutString(str);
		return 0;
	}

