robovero/firmware/src/wrap/_LPC17xx.c
	LPC_PINCON_TypeDef_ptr->PINMODE1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE4(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE4);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE4 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE5(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE5);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE5 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE6(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE6);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE6 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE7(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE7);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE7 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE8(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE8);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE8 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE9(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE9);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE9 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE_OD0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE_OD0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE_OD0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE_OD1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE_OD1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE_OD1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE_OD2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE_OD2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE_OD2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_PINMODE_OD3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE_OD3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE_OD3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

