robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_PINCON_TypeDef_PINMODE_OD4(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->PINMODE_OD4);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->PINMODE_OD4 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PINCON_TypeDef_I2CPADCFG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PINCON_TypeDef* LPC_PINCON_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PINCON_TypeDef_ptr = (LPC_PINCON_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PINCON_TypeDef_ptr->I2CPADCFG);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PINCON_TypeDef_ptr->I2CPADCFG = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_I2C_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_I2C_TypeDef_I2CONSET(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2CONSET);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2CONSET = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2STAT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2STAT);
	writeUSBOutString(str);
	return 0;
}

int _LPC_I2C_TypeDef_I2DAT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2DAT);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2DAT = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2ADR0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2ADR0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2ADR0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2SCLH(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2SCLH);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2SCLH = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2SCLL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2SCLL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2SCLL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2CONCLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_I2C_TypeDef_ptr->I2CONCLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_MMCTRL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->MMCTRL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->MMCTRL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2ADR1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2ADR1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2ADR1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2ADR2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2ADR2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2ADR2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

