robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_I2C_TypeDef_I2ADR3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2ADR3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2ADR3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2DATA_BUFFER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2DATA_BUFFER);
	writeUSBOutString(str);
	return 0;
}

int _LPC_I2C_TypeDef_I2MASK0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2MASK0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2MASK0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2MASK1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2MASK1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2MASK1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2MASK2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2MASK2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2MASK2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2C_TypeDef_I2MASK3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2C_TypeDef* LPC_I2C_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2C_TypeDef_ptr = (LPC_I2C_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2C_TypeDef_ptr->I2MASK3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2C_TypeDef_ptr->I2MASK3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_WDT_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_WDT_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_WDT_TypeDef_WDMOD(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_WDT_TypeDef* LPC_WDT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_WDT_TypeDef_ptr = (LPC_WDT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_WDT_TypeDef_ptr->WDMOD);
		writeUSBOutString(str);
		return 0;
	}

	LPC_WDT_TypeDef_ptr->WDMOD = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_WDT_TypeDef_WDTC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_WDT_TypeDef* LPC_WDT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_WDT_TypeDef_ptr = (LPC_WDT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_WDT_TypeDef_ptr->WDTC);
		writeUSBOutString(str);
		return 0;
	}

	LPC_WDT_TypeDef_ptr->WDTC = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_WDT_TypeDef_WDFEED(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_WDT_TypeDef* LPC_WDT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_WDT_TypeDef_ptr = (LPC_WDT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_WDT_TypeDef_ptr->WDFEED = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_WDT_TypeDef_WDTV(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_WDT_TypeDef* LPC_WDT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_WDT_TypeDef_ptr = (LPC_WDT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_WDT_TypeDef_ptr->WDTV);
	writeUSBOutString(str);
	return 0;
}

int _LPC_WDT_TypeDef_WDCLKSEL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_WDT_TypeDef* LPC_WDT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_WDT_TypeDef_ptr = (LPC_WDT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_WDT_TypeDef_ptr->WDCLKSEL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_WDT_TypeDef_ptr->WDCLKSEL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_UART_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART_TypeDef_RBR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->RBR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART_TypeDef_THR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_UART_TypeDef_ptr->THR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_DLL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->DLL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->DLL = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_DLM(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->DLM);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->DLM = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_IER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->IER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->IER = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_IIR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->IIR);
	writeUSBOutString(str);
	return 0;
}

