robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_UART_TypeDef_FCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_UART_TypeDef_ptr->FCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_LCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->LCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->LCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_LSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->LSR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART_TypeDef_SCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->SCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->SCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_ACR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->ACR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->ACR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_ICR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->ICR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->ICR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_FDR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->FDR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->FDR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_TER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->TER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART_TypeDef_ptr->TER = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART_TypeDef_FIFOLVL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART_TypeDef* LPC_UART_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART_TypeDef_ptr = (LPC_UART_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART_TypeDef_ptr->FIFOLVL);
	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_QEI_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_QEICON(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_QEI_TypeDef_ptr->QEICON = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_QEISTAT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEISTAT);
	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_QEICONF(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEICONF);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->QEICONF = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_QEIPOS(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEIPOS);
	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_QEIMAXPOS(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEIMAXPOS);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->QEIMAXPOS = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_CMPOS0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->CMPOS0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->CMPOS0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_CMPOS1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->CMPOS1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->CMPOS1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_CMPOS2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->CMPOS2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->CMPOS2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_INXCNT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->INXCNT);
	writeUSBOutString(str);
	return 0;

