robovero/firmware/src/wrap/_LPC17xx.c
}

int _LPC_QEI_TypeDef_INXCMP(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->INXCMP);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->INXCMP = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_QEILOAD(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEILOAD);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->QEILOAD = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_QEITIME(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEITIME);
	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_QEIVEL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEIVEL);

	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_QEICAP(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEICAP);
	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_VELCOMP(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->VELCOMP);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->VELCOMP = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_FILTER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->FILTER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_QEI_TypeDef_ptr->FILTER = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_QEIIEC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_QEI_TypeDef_ptr->QEIIEC = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_QEIIES(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_QEI_TypeDef_ptr->QEIIES = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_QEIINTSTAT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEIINTSTAT);
	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_QEIIE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_QEI_TypeDef_ptr->QEIIE);
	writeUSBOutString(str);
	return 0;
}

int _LPC_QEI_TypeDef_QEICLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_QEI_TypeDef_ptr->QEICLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_QEI_TypeDef_QEISET(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_QEI_TypeDef* LPC_QEI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_QEI_TypeDef_ptr = (LPC_QEI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_QEI_TypeDef_ptr->QEISET = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SPI_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_SPI_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_SPI_TypeDef_SPCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SPI_TypeDef* LPC_SPI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SPI_TypeDef_ptr = (LPC_SPI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SPI_TypeDef_ptr->SPCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SPI_TypeDef_ptr->SPCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SPI_TypeDef_SPSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SPI_TypeDef* LPC_SPI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SPI_TypeDef_ptr = (LPC_SPI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

