robovero/firmware/src/wrap/_LPC17xx.c
	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SPI_TypeDef_ptr->SPSR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_SPI_TypeDef_SPDR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SPI_TypeDef* LPC_SPI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SPI_TypeDef_ptr = (LPC_SPI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SPI_TypeDef_ptr->SPDR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SPI_TypeDef_ptr->SPDR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SPI_TypeDef_SPCCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SPI_TypeDef* LPC_SPI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SPI_TypeDef_ptr = (LPC_SPI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SPI_TypeDef_ptr->SPCCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SPI_TypeDef_ptr->SPCCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SPI_TypeDef_SPINT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SPI_TypeDef* LPC_SPI_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SPI_TypeDef_ptr = (LPC_SPI_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SPI_TypeDef_ptr->SPINT);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SPI_TypeDef_ptr->SPINT = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_SC_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_SC_TypeDef_FLASHCFG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->FLASHCFG);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->FLASHCFG = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_PLL0CON(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PLL0CON);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->PLL0CON = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_PLL0CFG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PLL0CFG);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->PLL0CFG = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_PLL0STAT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PLL0STAT);
	writeUSBOutString(str);
	return 0;
}

int _LPC_SC_TypeDef_PLL0FEED(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_SC_TypeDef_ptr->PLL0FEED = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_PLL1CON(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PLL1CON);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->PLL1CON = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_PLL1CFG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PLL1CFG);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->PLL1CFG = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_PLL1STAT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PLL1STAT);
	writeUSBOutString(str);
	return 0;
}

int _LPC_SC_TypeDef_PLL1FEED(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_SC_TypeDef_ptr->PLL1FEED = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_PCON(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PCON);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->PCON = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

