robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_SC_TypeDef_PCONP(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PCONP);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->PCONP = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_CCLKCFG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->CCLKCFG);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->CCLKCFG = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_USBCLKCFG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->USBCLKCFG);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->USBCLKCFG = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_CLKSRCSEL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->CLKSRCSEL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->CLKSRCSEL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_CANSLEEPCLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->CANSLEEPCLR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->CANSLEEPCLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_CANWAKEFLAGS(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->CANWAKEFLAGS);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->CANWAKEFLAGS = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_EXTINT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->EXTINT);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->EXTINT = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_EXTMODE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->EXTMODE);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->EXTMODE = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_EXTPOLAR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->EXTPOLAR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->EXTPOLAR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_RSID(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->RSID);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->RSID = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_SCS(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->SCS);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->SCS = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_IRCTRIM(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->IRCTRIM);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->IRCTRIM = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_PCLKSEL0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PCLKSEL0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->PCLKSEL0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

