robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_SC_TypeDef_PCLKSEL1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->PCLKSEL1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->PCLKSEL1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SC_TypeDef_USBIntSt(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->USBIntSt);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->USBIntSt = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

/*int _LPC_SC_TypeDef_DMAREQSEL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->DMAREQSEL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->DMAREQSEL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}*/

int _LPC_SC_TypeDef_CLKOUTCFG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SC_TypeDef* LPC_SC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SC_TypeDef_ptr = (LPC_SC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SC_TypeDef_ptr->CLKOUTCFG);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SC_TypeDef_ptr->CLKOUTCFG = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_USB_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_HcRevision(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcRevision);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_HcControl(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcControl);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcControl = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcCommandStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcCommandStatus);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcCommandStatus = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcInterruptStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcInterruptStatus);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcInterruptStatus = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcInterruptEnable(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcInterruptEnable);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcInterruptEnable = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcInterruptDisable(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcInterruptDisable);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcInterruptDisable = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcHCCA(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcHCCA);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcHCCA = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcPeriodCurrentED(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcPeriodCurrentED);
	writeUSBOutString(str);
	return 0;
}

