robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_USB_TypeDef_HcControlHeadED(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcControlHeadED);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcControlHeadED = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcControlCurrentED(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcControlCurrentED);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcControlCurrentED = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcBulkHeadED(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcBulkHeadED);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcBulkHeadED = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcBulkCurrentED(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcBulkCurrentED);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcBulkCurrentED = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcDoneHead(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcDoneHead);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_HcFmInterval(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcFmInterval);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcFmInterval = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcFmRemaining(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcFmRemaining);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_HcFmNumber(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcFmNumber);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_HcPeriodicStart(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcPeriodicStart);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcPeriodicStart = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcLSTreshold(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcLSTreshold);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcLSTreshold = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcRhDescriptorA(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcRhDescriptorA);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcRhDescriptorA = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;

}

int _LPC_USB_TypeDef_HcRhDescriptorB(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcRhDescriptorB);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->HcRhDescriptorB = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_HcRhStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->HcRhStatus);
		writeUSBOutString(str);
		return 0;
	}

