robovero/firmware/src/wrap/_LPC17xx.c
	LPC_USB_TypeDef_ptr->USBDMARSet = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBUDCAH(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBUDCAH);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->USBUDCAH = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBEpDMASt(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBEpDMASt);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_USBEpDMAEn(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->USBEpDMAEn = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBEpDMADis(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->USBEpDMADis = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBDMAIntSt(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBDMAIntSt);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_USBDMAIntEn(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBDMAIntEn);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->USBDMAIntEn = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBEoTIntSt(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBEoTIntSt);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_USBEoTIntClr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->USBEoTIntClr = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBEoTIntSet(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->USBEoTIntSet = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBNDDRIntSt(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBNDDRIntSt);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_USBNDDRIntClr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->USBNDDRIntClr = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBNDDRIntSet(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->USBNDDRIntSet = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBSysErrIntSt(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBSysErrIntSt);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_USBSysErrIntClr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->USBSysErrIntClr = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBSysErrIntSet(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->USBSysErrIntSet = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_I2C_RX(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

