robovero/firmware/src/wrap/_LPC17xx.c
	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->I2C_RX);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_I2C_TX(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->I2C_TX = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_I2C_STS(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->I2C_STS);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_I2C_CTL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->I2C_CTL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->I2C_CTL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_I2C_CLKHI(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->I2C_CLKHI);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->I2C_CLKHI = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_I2C_CLKLO(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_USB_TypeDef_ptr->I2C_CLKLO = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBClkCtrl(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBClkCtrl);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->USBClkCtrl = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_OTGClkCtrl(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->OTGClkCtrl);
		writeUSBOutString(str);
		return 0;
	}

	LPC_USB_TypeDef_ptr->OTGClkCtrl = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_USB_TypeDef_USBClkSt(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->USBClkSt);
	writeUSBOutString(str);
	return 0;
}

int _LPC_USB_TypeDef_OTGClkSt(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_USB_TypeDef* LPC_USB_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_USB_TypeDef_ptr = (LPC_USB_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_USB_TypeDef_ptr->OTGClkSt);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMACH_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_GPDMACH_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMACH_TypeDef_DMACCSrcAddr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMACH_TypeDef* LPC_GPDMACH_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMACH_TypeDef_ptr = (LPC_GPDMACH_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMACH_TypeDef_ptr->DMACCSrcAddr);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMACH_TypeDef_ptr->DMACCSrcAddr = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMACH_TypeDef_DMACCDestAddr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMACH_TypeDef* LPC_GPDMACH_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMACH_TypeDef_ptr = (LPC_GPDMACH_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMACH_TypeDef_ptr->DMACCDestAddr);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMACH_TypeDef_ptr->DMACCDestAddr = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMACH_TypeDef_DMACCLLI(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMACH_TypeDef* LPC_GPDMACH_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMACH_TypeDef_ptr = (LPC_GPDMACH_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMACH_TypeDef_ptr->DMACCLLI);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMACH_TypeDef_ptr->DMACCLLI = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

