robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_GPDMACH_TypeDef_DMACCControl(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMACH_TypeDef* LPC_GPDMACH_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMACH_TypeDef_ptr = (LPC_GPDMACH_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMACH_TypeDef_ptr->DMACCControl);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMACH_TypeDef_ptr->DMACCControl = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMACH_TypeDef_DMACCConfig(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMACH_TypeDef* LPC_GPDMACH_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMACH_TypeDef_ptr = (LPC_GPDMACH_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMACH_TypeDef_ptr->DMACCConfig);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMACH_TypeDef_ptr->DMACCConfig = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_ADC_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_ADC_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_ADC_TypeDef_ptr->ADCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_ADC_TypeDef_ADGDR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADGDR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_ADC_TypeDef_ptr->ADGDR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_ADC_TypeDef_ADINTEN(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADINTEN);
		writeUSBOutString(str);
		return 0;
	}

	LPC_ADC_TypeDef_ptr->ADINTEN = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_ADC_TypeDef_ADDR0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADDR0);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADDR1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);


	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADDR1);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADDR2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADDR2);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADDR3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADDR3);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADDR4(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADDR4);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADDR5(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADDR5);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADDR6(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADDR6);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADDR7(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADDR7);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADSTAT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

