robovero/firmware/src/wrap/_LPC17xx.c
	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADSTAT);
	writeUSBOutString(str);
	return 0;
}

int _LPC_ADC_TypeDef_ADTRM(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_ADC_TypeDef* LPC_ADC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_ADC_TypeDef_ptr = (LPC_ADC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_ADC_TypeDef_ptr->ADTRM);
		writeUSBOutString(str);
		return 0;
	}

	LPC_ADC_TypeDef_ptr->ADTRM = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMA_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_GPDMA_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACIntStat(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACIntStat);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACIntTCStat(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACIntTCStat);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACIntTCClear(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_GPDMA_TypeDef_ptr->DMACIntTCClear = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACIntErrStat(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACIntErrStat);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACIntErrClr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_GPDMA_TypeDef_ptr->DMACIntErrClr = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACRawIntTCStat(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACRawIntTCStat);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACRawIntErrStat(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACRawIntErrStat);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACEnbldChns(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACEnbldChns);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACSoftBReq(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACSoftBReq);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMA_TypeDef_ptr->DMACSoftBReq = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACSoftSReq(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACSoftSReq);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMA_TypeDef_ptr->DMACSoftSReq = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACSoftLBReq(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACSoftLBReq);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMA_TypeDef_ptr->DMACSoftLBReq = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACSoftLSReq(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACSoftLSReq);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMA_TypeDef_ptr->DMACSoftLSReq = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

