robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_GPDMA_TypeDef_DMACConfig(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACConfig);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMA_TypeDef_ptr->DMACConfig = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPDMA_TypeDef_DMACSync(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPDMA_TypeDef* LPC_GPDMA_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPDMA_TypeDef_ptr = (LPC_GPDMA_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPDMA_TypeDef_ptr->DMACSync);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPDMA_TypeDef_ptr->DMACSync = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_RTC_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_RTC_TypeDef_ILR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ILR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ILR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_CCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->CCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->CCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_CIIR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->CIIR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->CIIR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_AMR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->AMR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->AMR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_CTIME0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->CTIME0);
	writeUSBOutString(str);
	return 0;
}

int _LPC_RTC_TypeDef_CTIME1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->CTIME1);
	writeUSBOutString(str);
	return 0;
}

int _LPC_RTC_TypeDef_CTIME2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->CTIME2);
	writeUSBOutString(str);
	return 0;
}

int _LPC_RTC_TypeDef_SEC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->SEC);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->SEC = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_MIN(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->MIN);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->MIN = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_HOUR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->HOUR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->HOUR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

