robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_RTC_TypeDef_DOM(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->DOM);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->DOM = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_DOW(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->DOW);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->DOW = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_DOY(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->DOY);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->DOY = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_MONTH(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->MONTH);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->MONTH = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_YEAR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->YEAR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->YEAR = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_CALIBRATION(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->CALIBRATION);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->CALIBRATION = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_GPREG0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->GPREG0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->GPREG0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_GPREG1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->GPREG1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->GPREG1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_GPREG2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->GPREG2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->GPREG2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_GPREG3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->GPREG3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->GPREG3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_GPREG4(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->GPREG4);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->GPREG4 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_RTC_AUXEN(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->RTC_AUXEN);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->RTC_AUXEN = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

