robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_RTC_TypeDef_RTC_AUX(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->RTC_AUX);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->RTC_AUX = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_ALSEC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ALSEC);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ALSEC = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_ALMIN(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ALMIN);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ALMIN = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_ALHOUR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ALHOUR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ALHOUR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_ALDOM(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ALDOM);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ALDOM = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_ALDOW(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ALDOW);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ALDOW = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_ALDOY(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ALDOY);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ALDOY = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_ALMON(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ALMON);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ALMON = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RTC_TypeDef_ALYEAR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RTC_TypeDef* LPC_RTC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RTC_TypeDef_ptr = (LPC_RTC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RTC_TypeDef_ptr->ALYEAR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RTC_TypeDef_ptr->ALYEAR = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_MCPWM_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCON(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCCON);
	writeUSBOutString(str);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCON_SET(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCCON_SET = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCON_CLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCCON_CLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCAPCON(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCCAPCON);
	writeUSBOutString(str);
	return 0;
}

