robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_MCPWM_TypeDef_MCCAPCON_SET(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCCAPCON_SET = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCAPCON_CLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCCAPCON_CLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCTIM0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCTIM0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCTIM0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCTIM1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCTIM1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCTIM1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCTIM2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCTIM2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCTIM2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCPER0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCPER0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCPER0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCPER1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCPER1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCPER1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCPER2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCPER2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCPER2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCPW0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCPW0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCPW0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCPW1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCPW1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCPW1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCPW2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCPW2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCPW2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCDEADTIME(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCDEADTIME);
		writeUSBOutString(str);
		return 0;
	}

