robovero/firmware/src/wrap/_LPC17xx.c
	LPC_MCPWM_TypeDef_ptr->MCDEADTIME = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCCP(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCCCP);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCCCP = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCR0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCCR0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCCR0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCR1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCCR1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCCR1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCR2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCCR2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_MCPWM_TypeDef_ptr->MCCR2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCINTEN(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCINTEN);
	writeUSBOutString(str);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCINTEN_SET(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCINTEN_SET = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCINTEN_CLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCINTEN_CLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCNTCON(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCCNTCON);
	writeUSBOutString(str);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCNTCON_SET(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCCNTCON_SET = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCNTCON_CLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCCNTCON_CLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCINTFLAG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_MCPWM_TypeDef_ptr->MCINTFLAG);
	writeUSBOutString(str);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCINTFLAG_SET(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCINTFLAG_SET = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCINTFLAG_CLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCINTFLAG_CLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_MCPWM_TypeDef_MCCAP_CLR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_MCPWM_TypeDef* LPC_MCPWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_MCPWM_TypeDef_ptr = (LPC_MCPWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_MCPWM_TypeDef_ptr->MCCAP_CLR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_I2S_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

