robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_I2S_TypeDef_I2SDAO(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SDAO);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2SDAO = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2SDAI(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SDAI);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2SDAI = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2STXFIFO(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_I2S_TypeDef_ptr->I2STXFIFO = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2SRXFIFO(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SRXFIFO);
	writeUSBOutString(str);
	return 0;
}

int _LPC_I2S_TypeDef_I2SSTATE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SSTATE);
	writeUSBOutString(str);
	return 0;
}

int _LPC_I2S_TypeDef_I2SDMA1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SDMA1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2SDMA1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2SDMA2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SDMA2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2SDMA2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2SIRQ(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SIRQ);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2SIRQ = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2STXRATE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2STXRATE);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2STXRATE = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2SRXRATE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SRXRATE);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2SRXRATE = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2STXBITRATE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2STXBITRATE);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2STXBITRATE = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2SRXBITRATE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SRXBITRATE);
		writeUSBOutString(str);
		return 0;
	}

