robovero/firmware/src/wrap/_LPC17xx.c
	LPC_I2S_TypeDef_ptr->I2SRXBITRATE = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2STXMODE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2STXMODE);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2STXMODE = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_I2S_TypeDef_I2SRXMODE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_I2S_TypeDef* LPC_I2S_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_I2S_TypeDef_ptr = (LPC_I2S_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_I2S_TypeDef_ptr->I2SRXMODE);
		writeUSBOutString(str);
		return 0;
	}

	LPC_I2S_TypeDef_ptr->I2SRXMODE = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_UART1_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART1_TypeDef_RBR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->RBR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART1_TypeDef_THR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_UART1_TypeDef_ptr->THR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_DLL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->DLL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->DLL = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_DLM(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->DLM);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->DLM = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_IER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->IER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->IER = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_IIR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->IIR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART1_TypeDef_FCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_UART1_TypeDef_ptr->FCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_LCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->LCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->LCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_MCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->MCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->MCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_LSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->LSR);
	writeUSBOutString(str);
	return 0;
}

