robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_UART1_TypeDef_MSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->MSR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_UART1_TypeDef_SCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->SCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->SCR = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_ACR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->ACR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->ACR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_FDR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->FDR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->FDR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_TER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->TER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->TER = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_RS485CTRL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->RS485CTRL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->RS485CTRL = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_ADRMATCH(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->ADRMATCH);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->ADRMATCH = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_RS485DLY(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->RS485DLY);
		writeUSBOutString(str);
		return 0;
	}

	LPC_UART1_TypeDef_ptr->RS485DLY = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_UART1_TypeDef_FIFOLVL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_UART1_TypeDef* LPC_UART1_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_UART1_TypeDef_ptr = (LPC_UART1_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_UART1_TypeDef_ptr->FIFOLVL);
	writeUSBOutString(str);
	return 0;
}

int _LPC_RIT_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_RIT_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_RIT_TypeDef_RICOMPVAL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RIT_TypeDef* LPC_RIT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RIT_TypeDef_ptr = (LPC_RIT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RIT_TypeDef_ptr->RICOMPVAL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RIT_TypeDef_ptr->RICOMPVAL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RIT_TypeDef_RIMASK(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RIT_TypeDef* LPC_RIT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RIT_TypeDef_ptr = (LPC_RIT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RIT_TypeDef_ptr->RIMASK);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RIT_TypeDef_ptr->RIMASK = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_RIT_TypeDef_RICTRL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RIT_TypeDef* LPC_RIT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RIT_TypeDef_ptr = (LPC_RIT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RIT_TypeDef_ptr->RICTRL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RIT_TypeDef_ptr->RICTRL = (uint8_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

