robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_RIT_TypeDef_RICOUNTER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_RIT_TypeDef* LPC_RIT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_RIT_TypeDef_ptr = (LPC_RIT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_RIT_TypeDef_ptr->RICOUNTER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_RIT_TypeDef_ptr->RICOUNTER = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIOINT_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_GPIOINT_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IntStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IntStatus);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO0IntStatR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IO0IntStatR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO0IntStatF(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IO0IntStatF);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO0IntClr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_GPIOINT_TypeDef_ptr->IO0IntClr = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO0IntEnR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IO0IntEnR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIOINT_TypeDef_ptr->IO0IntEnR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO0IntEnF(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IO0IntEnF);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIOINT_TypeDef_ptr->IO0IntEnF = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO2IntStatR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IO2IntStatR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO2IntStatF(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IO2IntStatF);
	writeUSBOutString(str);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO2IntClr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_GPIOINT_TypeDef_ptr->IO2IntClr = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO2IntEnR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IO2IntEnR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIOINT_TypeDef_ptr->IO2IntEnR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_GPIOINT_TypeDef_IO2IntEnF(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_GPIOINT_TypeDef* LPC_GPIOINT_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_GPIOINT_TypeDef_ptr = (LPC_GPIOINT_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_GPIOINT_TypeDef_ptr->IO2IntEnF);
		writeUSBOutString(str);
		return 0;
	}

	LPC_GPIOINT_TypeDef_ptr->IO2IntEnF = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

