robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_SSP_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_SSP_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_SSP_TypeDef_CR0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->CR0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->CR0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SSP_TypeDef_CR1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->CR1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->CR1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SSP_TypeDef_DR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->DR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->DR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SSP_TypeDef_SR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->SR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_SSP_TypeDef_CPSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->CPSR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->CPSR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SSP_TypeDef_IMSC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->IMSC);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->IMSC = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SSP_TypeDef_RIS(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->RIS);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->RIS = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SSP_TypeDef_MIS(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->MIS);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->MIS = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SSP_TypeDef_ICR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->ICR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->ICR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_SSP_TypeDef_DMACR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_SSP_TypeDef* LPC_SSP_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_SSP_TypeDef_ptr = (LPC_SSP_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_SSP_TypeDef_ptr->DMACR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_SSP_TypeDef_ptr->DMACR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_DAC_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_DAC_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_DAC_TypeDef_DACR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_DAC_TypeDef* LPC_DAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_DAC_TypeDef_ptr = (LPC_DAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_DAC_TypeDef_ptr->DACR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_DAC_TypeDef_ptr->DACR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_DAC_TypeDef_DACCTRL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_DAC_TypeDef* LPC_DAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_DAC_TypeDef_ptr = (LPC_DAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_DAC_TypeDef_ptr->DACCTRL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_DAC_TypeDef_ptr->DACCTRL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_DAC_TypeDef_DACCNTVAL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_DAC_TypeDef* LPC_DAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_DAC_TypeDef_ptr = (LPC_DAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_DAC_TypeDef_ptr->DACCNTVAL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_DAC_TypeDef_ptr->DACCNTVAL = (uint16_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_CAN_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

