robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_CAN_TypeDef_MOD(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->MOD);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->MOD = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_CMR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_CAN_TypeDef_ptr->CMR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_GSR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->GSR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->GSR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_ICR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->ICR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_CAN_TypeDef_IER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->IER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->IER = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_BTR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->BTR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->BTR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_EWL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->EWL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->EWL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_SR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->SR);
	writeUSBOutString(str);
	return 0;
}

int _LPC_CAN_TypeDef_RFS(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->RFS);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->RFS = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_RID(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->RID);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->RID = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_RDA(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->RDA);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->RDA = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_RDB(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->RDB);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->RDB = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TFI1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TFI1);
		writeUSBOutString(str);
		return 0;
	}

