robovero/firmware/src/wrap/_LPC17xx.c
	LPC_CAN_TypeDef_ptr->TFI1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TID1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TID1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TID1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TDA1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TDA1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TDA1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TDB1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TDB1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TDB1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TFI2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TFI2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TFI2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TID2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TID2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TID2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TDA2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TDA2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TDA2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TDB2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TDB2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TDB2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TFI3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TFI3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TFI3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TID3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TID3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TID3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TDA3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TDA3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TDA3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CAN_TypeDef_TDB3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CAN_TypeDef* LPC_CAN_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CAN_TypeDef_ptr = (LPC_CAN_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CAN_TypeDef_ptr->TDB3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CAN_TypeDef_ptr->TDB3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_RAM_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_CANAF_RAM_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

/*int _LPC_CANAF_RAM_TypeDef_mask[512](uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_RAM_TypeDef* LPC_CANAF_RAM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_RAM_TypeDef_ptr = (LPC_CANAF_RAM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_RAM_TypeDef_ptr->mask[512]);
		writeUSBOutString(str);
		return 0;
	}

