robovero/firmware/src/wrap/_LPC17xx.c
	LPC_CANAF_RAM_TypeDef_ptr->mask[512] = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}*/

int _LPC_CANAF_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_CANAF_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_CANAF_TypeDef_AFMR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->AFMR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->AFMR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_TypeDef_SFF_sa(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->SFF_sa);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->SFF_sa = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_TypeDef_SFF_GRP_sa(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->SFF_GRP_sa);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->SFF_GRP_sa = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_TypeDef_EFF_sa(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->EFF_sa);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->EFF_sa = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_TypeDef_EFF_GRP_sa(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->EFF_GRP_sa);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->EFF_GRP_sa = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_TypeDef_ENDofTable(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->ENDofTable);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->ENDofTable = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_TypeDef_LUTerrAd(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->LUTerrAd);
	writeUSBOutString(str);
	return 0;
}

int _LPC_CANAF_TypeDef_LUTerr(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->LUTerr);
	writeUSBOutString(str);
	return 0;
}

int _LPC_CANAF_TypeDef_FCANIE(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->FCANIE);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->FCANIE = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_TypeDef_FCANIC0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->FCANIC0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->FCANIC0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_CANAF_TypeDef_FCANIC1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_CANAF_TypeDef* LPC_CANAF_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_CANAF_TypeDef_ptr = (LPC_CANAF_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_CANAF_TypeDef_ptr->FCANIC1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_CANAF_TypeDef_ptr->FCANIC1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_EMAC_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

