robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_EMAC_TypeDef_MAC1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->MAC1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->MAC1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_MAC2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->MAC2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->MAC2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_IPGT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->IPGT);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->IPGT = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_IPGR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->IPGR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->IPGR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_CLRT(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->CLRT);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->CLRT = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_MAXF(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->MAXF);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->MAXF = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_SUPP(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->SUPP);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->SUPP = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_TEST(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->TEST);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->TEST = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_MCFG(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->MCFG);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->MCFG = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_MCMD(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->MCMD);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->MCMD = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_MADR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->MADR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->MADR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_MWTD(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_EMAC_TypeDef_ptr->MWTD = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

