robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_EMAC_TypeDef_MRDD(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->MRDD);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_MIND(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->MIND);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_SA0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->SA0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->SA0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_SA1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->SA1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->SA1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_SA2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->SA2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->SA2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_Command(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->Command);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->Command = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_Status(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->Status);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_RxDescriptor(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RxDescriptor);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->RxDescriptor = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_RxStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RxStatus);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->RxStatus = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_RxDescriptorNumber(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RxDescriptorNumber);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->RxDescriptorNumber = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_RxProduceIndex(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RxProduceIndex);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_RxConsumeIndex(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RxConsumeIndex);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->RxConsumeIndex = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_TxDescriptor(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->TxDescriptor);
		writeUSBOutString(str);
		return 0;
	}

