robovero/firmware/src/wrap/_LPC17xx.c
	LPC_EMAC_TypeDef_ptr->TxDescriptor = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_TxStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->TxStatus);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->TxStatus = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_TxDescriptorNumber(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->TxDescriptorNumber);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->TxDescriptorNumber = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_TxProduceIndex(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->TxProduceIndex);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->TxProduceIndex = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_TxConsumeIndex(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->TxConsumeIndex);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_TSV0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->TSV0);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_TSV1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->TSV1);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_RSV(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RSV);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_FlowControlCounter(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->FlowControlCounter);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->FlowControlCounter = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_FlowControlStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->FlowControlStatus);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_RxFilterCtrl(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RxFilterCtrl);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->RxFilterCtrl = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_RxFilterWoLStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RxFilterWoLStatus);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->RxFilterWoLStatus = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_RxFilterWoLClear(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->RxFilterWoLClear);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->RxFilterWoLClear = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

