robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_EMAC_TypeDef_HashFilterL(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->HashFilterL);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->HashFilterL = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_HashFilterH(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->HashFilterH);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->HashFilterH = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_IntStatus(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->IntStatus);
	writeUSBOutString(str);
	return 0;
}

int _LPC_EMAC_TypeDef_IntEnable(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->IntEnable);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->IntEnable = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_IntClear(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_EMAC_TypeDef_ptr->IntClear = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_IntSet(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		return 1;
	}

	LPC_EMAC_TypeDef_ptr->IntSet = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_PowerDown(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->PowerDown);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->PowerDown = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_EMAC_TypeDef_Module_ID(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_EMAC_TypeDef* LPC_EMAC_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_EMAC_TypeDef_ptr = (LPC_EMAC_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_EMAC_TypeDef_ptr->Module_ID);
		writeUSBOutString(str);
		return 0;
	}

	LPC_EMAC_TypeDef_ptr->Module_ID = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_PWM_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_PWM_TypeDef_IR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->IR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->IR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_TCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->TCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->TCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_TC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->TC);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->TC = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_PR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->PR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->PR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_PC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->PC);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->PC = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_MCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->MCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->MCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_MR0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->MR0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->MR0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_MR1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->MR1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->MR1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_MR2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->MR2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->MR2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_MR3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->MR3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->MR3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

