robovero/firmware/src/wrap/_LPC17xx.c
int _LPC_PWM_TypeDef_CCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->CCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->CCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_CR0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->CR0);
	writeUSBOutString(str);
	return 0;
}

int _LPC_PWM_TypeDef_CR1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->CR1);
	writeUSBOutString(str);
	return 0;
}

int _LPC_PWM_TypeDef_CR2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->CR2);
	writeUSBOutString(str);
	return 0;
}

int _LPC_PWM_TypeDef_CR3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->CR3);
	writeUSBOutString(str);
	return 0;
}

int _LPC_PWM_TypeDef_MR4(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->MR4);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->MR4 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_MR5(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->MR5);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->MR5 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_MR6(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->MR6);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->MR6 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_PCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->PCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->PCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_LER(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->LER);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->LER = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_PWM_TypeDef_CTCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_PWM_TypeDef* LPC_PWM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_PWM_TypeDef_ptr = (LPC_PWM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_PWM_TypeDef_ptr->CTCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_PWM_TypeDef_ptr->CTCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(LPC_TIM_TypeDef)));
	writeUSBOutString(str);
	return 0;
}

int _LPC_TIM_TypeDef_IR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->IR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->IR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_TCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->TCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->TCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_TC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->TC);
		writeUSBOutString(str);
		return 0;
	}

