robovero/firmware/src/wrap/_LPC17xx.c
	LPC_TIM_TypeDef_ptr->TC = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_PR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->PR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->PR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_PC(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->PC);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->PC = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_MCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->MCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->MCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_MR0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->MR0);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->MR0 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_MR1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->MR1);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->MR1 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_MR2(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->MR2);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->MR2 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_MR3(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->MR3);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->MR3 = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_CCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->CCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->CCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_CR0(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->CR0);
	writeUSBOutString(str);
	return 0;
}

int _LPC_TIM_TypeDef_CR1(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);

	sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->CR1);
	writeUSBOutString(str);
	return 0;
}

int _LPC_TIM_TypeDef_EMR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->EMR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->EMR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _LPC_TIM_TypeDef_CTCR(uint8_t * args)
{
	uint8_t * arg_ptr;
	LPC_TIM_TypeDef* LPC_TIM_TypeDef_ptr;

	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) return 1;
	LPC_TIM_TypeDef_ptr = (LPC_TIM_TypeDef *) strtoul((char *) arg_ptr, NULL, 16);
	if ((arg_ptr = (uint8_t *) strtok(NULL, " ")) == NULL) {
		sprintf((char *) str, "%x\r\n", (unsigned int) LPC_TIM_TypeDef_ptr->CTCR);
		writeUSBOutString(str);
		return 0;
	}

	LPC_TIM_TypeDef_ptr->CTCR = (uint32_t) strtoul((char *) arg_ptr, NULL, 16);
	return 0;
}

int _IRQn_Type_malloc(uint8_t * args)
{
	sprintf((char *) str, "%x\r\n", (unsigned int) malloc(sizeof(IRQn_Type)));
	writeUSBOutString(str);
	return 0;
}

